Repository: rocky-linux/documentation
Catalog: locales/po/*/00-toc.md.po
Languages: fr

source: # Learning Linux with Rocky
fr: # Apprendre Linux avec Rocky

source: The Administration Guide is a collection of Educational Documents focused on System Administrators. They can be used by future System Administrators trying to get up to speed, by current System Administrators who would like a refresher, or by any Linux user who'd like to learn more about the Linux environment, commands, processes, and more. Like all documents of this type, it will evolve and update over time.
fr: Le Guide d'administration est une collection de documents éducatifs destinés aux administrateurs système. Ils peuvent être utilisés par les anciens administrateurs système qui veulent se mettre à niveau, par les administrateurs système actuels qui souhaitent se rafraîchir la mémoire, ou par tout utilisateur de Linux qui souhaite en savoir plus sur l'environnement, les commandes, les processus et autres de Linux. Comme tous les documents de ce type, il évoluera et sera mis à jour au fil du temps.

source: Initially, we will discuss Linux, distributions, and the whole ecosystem around our operating system.
fr: Dans un premier temps, nous parlerons de Linux, des distributions et de tout l'écosystème autour de notre système d'exploitation.

source: We will then look at the user commands that are essential for getting up to speed with Linux. The more experienced users should also consult the chapter dedicated to the more "advanced" 'Commands.'
fr: Nous examinerons ensuite les commandes utilisateur indispensables pour se familiariser avec Linux. Les utilisateurs les plus expérimentés pourront également consulter le chapitre consacré aux "commandes" plus "avancées".

source: Next comes the chapter on the VI editor. While Linux comes with many editors, VI is one of the most powerful. Other commands sometimes use identical syntaxes as VI (`sed` comes to mind). So knowing something about VI, or at least demystifying its essential functions (how to open a file, save, quit or quit without saving), are very important to know. The user will become more comfortable with the other functions of VI as they use the editor. An alternative would be to use nano which comes installed by default in Rocky Linux. While not as versatile, it is simple to use, straightforward, and gets the job done.
fr: Vient ensuite le chapitre sur l'éditeur VI. Bien que Linux soit livré avec de nombreux éditeurs, VI est l'un des plus puissants. D'autres commandes utilisent parfois une syntaxe identique à celle de VI (on pense notamment à `sed`). Il est donc très important d'en connaître un minimum sur VI ou au moins de démystifier ses fonctions essentielles (comment ouvrir un fichier, sauvegarder, quitter ou quitter sans sauvegarder). L'utilisateur deviendra plus à l'aise avec les autres fonctions de VI au fur et à mesure qu'il utilisera l'éditeur. Une alternative serait d'utiliser `nano` qui est installé par défaut dans Rocky Linux. Bien qu'il ne soit pas aussi polyvalent, il est simple à utiliser, direct, et fait le travail.

source: We can then get into the deep functioning of Linux to discover how the system manages:
fr: Nous pouvons alors entrer dans le fonctionnement de Linux pour découvrir comment le système gère :

source: users.
fr: les utilisateurs.

source: file systems.
fr: les systèmes de fichiers.

source: processes.
fr: les processus.

source: Next, we will cover an essential subject for the System Administrator: The Backup Process. Many software solutions come with Linux to enhance Backups (rsnapshot, lsyncd, etcetera.)It is good to know the essential components of the backup that are within the operating system. We will investigate two tools: `tar` and the less widespread `cpio` in this chapter.
fr: Ensuite, nous allons aborder un sujet essentiel pour l'administrateur système : Le processus de sauvegarde. De nombreuses solutions logicielles sont fournies avec Linux pour améliorer les sauvegardes (rsnapshot, lsyncd, etc.). Il est bon de connaître les composants essentiels de la sauvegarde qui se trouvent dans le système d'exploitation. Nous allons étudier deux outils : `tar` et le moins répandu `cpio` dans ce chapitre.

source: Management of the system during the boot process has evolved significantly in recent years since the arrival of the systemd.
fr: La gestion du système pendant le processus de démarrage a beaucoup évolué ces dernières années depuis l'arrivée de systemd.

source: We will conclude by examining the management of tasks, the implementation of the network, and software installation.
fr: Nous terminerons en examinant la gestion des tâches, la mise en place du réseau et l'installation des logiciels.
